yonghui123/amp-vibe-analyzer/code_STM32/user/bsp/src/bsp_tft_lcd.c
		/* 此处统计不等宽字符有问题。暂时特殊处理下 */
		if (len != 3)
		{
			x = _pBtn->Left + (_pBtn->Width - len * 16) / 2;
		}
		else
		{
			x = _pBtn->Left + (_pBtn->Width - len * 20) / 2;
		}

		/* 对特殊字符特殊处理 */
		if ((len == 1) && (_pBtn->Caption[0] == '.'))
		{
			y = _pBtn->Top + 3;
			x += 3;
		}
		else
		{
			y = _pBtn->Top + 3;
		}

		RA8875_DispStr(x, y, _pBtn->Caption);

		RA8875_SetTextZoom(RA_SIZE_X1, RA_SIZE_X1);	/* 还原放大1倍 */
	}
#endif
}

/*
*********************************************************************************************************
*	函 数 名: LCD_DrawGroupBox
*	功能说明: 在LCD上绘制一个分组框
*	形    参: _pBox 分组框
*	返 回 值: 无
*********************************************************************************************************
*/
void LCD_DrawGroupBox(GROUP_T *_pBox)
{
	uint16_t x, y;

	/* 画阴影线 */
	LCD_DrawRect(_pBox->Left + 1, _pBox->Top + 5, _pBox->Height, _pBox->Width - 1, CL_BOX_BORDER2);

	/* 画主框线 */
	LCD_DrawRect(_pBox->Left, _pBox->Top + 4, _pBox->Height, _pBox->Width - 1, CL_BOX_BORDER1);

	/* 显示分组框标题（文字在左上角） */
	x = _pBox->Left + 9;
	y = _pBox->Top;
	LCD_DispStr(x, y, _pBox->pCaption, _pBox->Font);
}

/*
*********************************************************************************************************
*	函 数 名: LCD_DispControl
*	功能说明: 绘制控件
*	形    参: _pControl 控件指针
*	返 回 值: 无
*********************************************************************************************************
*/
void LCD_DispControl(void *_pControl)
{
	uint8_t id;

	id = *(uint8_t *)_pControl;	/* 读取ID */

	switch (id)
	{
		case ID_ICON:
			//void LCD_DrawIcon(const ICON_T *_tIcon, FONT_T *_tFont, uint8_t _ucFocusMode);
			break;

		case ID_WIN:
			LCD_DrawWin((WIN_T *)_pControl);
			break;

		case ID_LABEL:
			LCD_DrawLabel((LABEL_T *)_pControl);
			break;

		case ID_BUTTON:
			LCD_DrawButton((BUTTON_T *)_pControl);
			break;

		case ID_CHECK:
			LCD_DrawCheckBox((CHECK_T *)_pControl);
			break;

		case ID_EDIT:
			LCD_DrawEdit((EDIT_T *)_pControl);
			break;

		case ID_GROUP:
			LCD_DrawGroupBox((GROUP_T *)_pControl);
			break;
	}
}

/*
*********************************************************************************************************
*	函 数 名: LCD_SetBackLight
*	功能说明: 初始化控制LCD背景光的GPIO,配置为PWM模式。
*			当关闭背光时，将CPU IO设置为浮动输入模式（推荐设置为推挽输出，并驱动到低电平)；将TIM3关闭 省电
*	形    参: _bright 亮度，0是灭，255是最亮
*	返 回 值: 无
*********************************************************************************************************
*/
void LCD_SetBackLight(uint8_t _bright)
{
	s_ucBright =  _bright;	/* 保存背光值 */

	if (g_ChipID == IC_8875)
	{
		RA8875_SetBackLight(_bright);
	}
}

/*
*********************************************************************************************************
*	函 数 名: LCD_GetBackLight
*	功能说明: 获得背光亮度参数
*	形    参: 无
*	返 回 值: 背光亮度参数
*********************************************************************************************************
*/
uint8_t LCD_GetBackLight(void)
{
	return s_ucBright;
}
/*
*********************************************************************************************************
*	函 数 名: LCD_SetDirection
*	功能说明: 设置显示屏显示方向（横屏 竖屏）
*	形    参: 显示方向代码 0 横屏正常, 1=横屏180度翻转, 2=竖屏, 3=竖屏180度翻转
*	返 回 值: 无
*********************************************************************************************************
*/
void LCD_SetDirection(uint8_t _dir)
{
	g_LcdDirection =  _dir;		/* 保存在全局变量 */

	if (g_ChipID == IC_8875)
	{
		RA8875_SetDirection(_dir);
	}
}


/*
*********************************************************************************************************
*	函 数 名: LCD_ButtonTouchDown
*	功能说明: 判断按钮是否被按下. 检查触摸坐标是否在按钮的范围之内。并重绘按钮。
*	形    参:  _btn : 按钮对象
*			  _usX, _usY: 触摸坐标
*	返 回 值: 1 表示在范围内
*********************************************************************************************************
*/
uint8_t LCD_ButtonTouchDown(BUTTON_T *_btn, uint16_t _usX, uint16_t _usY)
{
	if ((_usX > _btn->Left) && (_usX < _btn->Left + _btn->Width)
		&& (_usY > _btn->Top) && (_usY < _btn->Top + _btn->Height))
	{
		//BUTTON_BEEP();	/* 按键提示音 bsp_tft_lcd.h 文件开头可以使能和关闭 */
		_btn->Focus = 1;
		LCD_DrawButton(_btn);
		return 1;
	}
	else
	{
		return 0;
	}
}

/*
*********************************************************************************************************
*	函 数 名: LCD_ButtonTouchRelease
*	功能说明: 判断按钮是否被触摸释放. 并重绘按钮。在触摸释放事件中被调用。
*	形    参:  _btn : 按钮对象
*			  _usX, _usY: 触摸坐标
*	返 回 值: 1 表示在范围内
*********************************************************************************************************
*/
uint8_t LCD_ButtonTouchRelease(BUTTON_T *_btn, uint16_t _usX, uint16_t _usY)
{
	_btn->Focus = 0;
	LCD_DrawButton(_btn);

	if ((_usX > _btn->Left) && (_usX < _btn->Left + _btn->Width)
		&& (_usY > _btn->Top) && (_usY < _btn->Top + _btn->Height))
	{
		return 1;
	}
	else
	{
		return 0;
	}
}

/*
*********************************************************************************************************
*	函 数 名: LCD_DrawLabel2
*	功能说明: 在LCD上绘制一个标签
*	形    参:
*			 *_pLabel :	标签结构体
*			  _Color  :	标签底色
*				_Arc  : 标签角弧度
*	返 回 值: 无
*********************************************************************************************************
*/
void LCD_DrawLabel2(LABEL_T *_pLabel, uint16_t _Color, uint8_t _Arc)
{
		uint16_t len, fwidth, x, y;
		//uint8_t _Arc = 10;
		/* 画弧边 */
		//LCD_DrawCircle(_pBtn->Left + _Arc, _pBtn->Top + _Arc, _Arc, BUTTON_BORDER_COLOR);
		RA8875_FillCircle(_pLabel->Left + _Arc, _pLabel->Top + _Arc,  _Arc,  _Color);					/* 左上圆 */
		RA8875_FillCircle(_pLabel->Left + _pLabel->Width - (_Arc + 1) , _pLabel->Top + _Arc, _Arc, _Color);			/* 右上圆 */
		RA8875_FillCircle(_pLabel->Left + _Arc, _pLabel->Top + _pLabel->Height - (_Arc + 1), _Arc, _Color);			/* 左下圆 */
		RA8875_FillCircle(_pLabel->Left + _pLabel->Width - (_Arc + 1), _pLabel->Top + _pLabel->Height - (_Arc + 1), _Arc, _Color);		/* 右下圆 */
		
		LCD_Fill_Rect(_pLabel->Left + _Arc, _pLabel->Top, _pLabel->Height, _pLabel->Width - 2 * _Arc, _Color);		/* 铺底色 */
		LCD_Fill_Rect(_pLabel->Left, _pLabel->Top + _Arc, _pLabel->Height - 2 * _Arc, _pLabel->Width, _Color);		
	
		/* 文字居中 */
		len = strlen(_pLabel->pCaption);

		if (_pLabel->Font->FontCode == FC_ST_16)
		{
			fwidth = 8;		/* 字体宽度 */
		}
		else if (_pLabel->Font->FontCode == FC_ST_12)
		{
			fwidth = 6;		/* 字体宽度 */
		}
		else if (_pLabel->Font->FontCode == FC_ST_16)
		{
			fwidth = 8;		/* 字体宽度 */
		}
		else if (_pLabel->Font->FontCode == FC_ST_24)
		{
			fwidth = 12;
		}
		else if (_pLabel->Font->FontCode == FC_ST_32)
		{
			fwidth = 16;
		}
		
		x = _pLabel->Left + _pLabel->Width / 2 - (len * fwidth) / 2;
		y = _pLabel->Top + _pLabel->Height / 2 - fwidth;

		LCD_DispStr(x, y, _pLabel->pCaption, _pLabel->Font);
}

