yonghui123/amp-vibe-analyzer/code_STM32/user/bsp/src/bsp_tft_lcd.c
/*
*********************************************************************************************************
*	函 数 名: LCD_DrawButton2
*	功能说明: 在LCD上绘制一个编辑框
*	形    参:
*			_usX, _usY : 图片的坐标
*			_usHeight  : 图片高度
*			_usWidth   : 图片宽度
*			_ptr       : 图片点阵指针
*	返 回 值: 无
*********************************************************************************************************
*/
void LCD_DrawButton2(BUTTON_T *_pBtn, uint8_t _Arc)
{
		uint16_t len, fwidth, x, y;
		//uint8_t _Arc = 10;
	
		if (_pBtn->Focus == 1)
		{
			RA8875_FillCircle(_pBtn->Left + _Arc, _pBtn->Top + _Arc,  _Arc,  CL_BLUE7);					/* 左上圆 */
			RA8875_FillCircle(_pBtn->Left + _pBtn->Width - (_Arc + 1) , _pBtn->Top + _Arc, _Arc, CL_BLUE7);			/* 右上圆 */
			RA8875_FillCircle(_pBtn->Left + _Arc, _pBtn->Top + _pBtn->Height - (_Arc + 1), _Arc, CL_BLUE8);			/* 左下圆 */
			RA8875_FillCircle(_pBtn->Left + _pBtn->Width - (_Arc + 1), _pBtn->Top + _pBtn->Height - (_Arc + 1), _Arc, CL_BLUE8);		/* 右下圆 */
			
			LCD_Fill_Rect(_pBtn->Left + _Arc, _pBtn->Top, _pBtn->Height, _pBtn->Width - 2 * _Arc, CL_BLUE8);		/* 铺底色 */
			LCD_Fill_Rect(_pBtn->Left, _pBtn->Top + _Arc, _pBtn->Height - 2 * _Arc, _pBtn->Width, CL_BLUE8);		
			
			LCD_Fill_Rect(_pBtn->Left + _Arc, _pBtn->Top, _pBtn->Height / 2, _pBtn->Width - 2 * _Arc, CL_BLUE7);	/* 画阴影对比色 */		
		}
		else
		{
			/* 画弧边 */
			//LCD_DrawCircle(_pBtn->Left + _Arc, _pBtn->Top + _Arc, _Arc, BUTTON_BORDER_COLOR);
			RA8875_FillCircle(_pBtn->Left + _Arc, _pBtn->Top + _Arc,  _Arc,  CL_GREY5);					/* 左上圆 */
			RA8875_FillCircle(_pBtn->Left + _pBtn->Width - (_Arc + 1) , _pBtn->Top + _Arc, _Arc, CL_GREY5);			/* 右上圆 */
			RA8875_FillCircle(_pBtn->Left + _Arc, _pBtn->Top + _pBtn->Height - (_Arc + 1), _Arc, CL_GREY5);			/* 左下圆 */
			RA8875_FillCircle(_pBtn->Left + _pBtn->Width - (_Arc + 1), _pBtn->Top + _pBtn->Height - (_Arc + 1), _Arc, CL_GREY5);		/* 右下圆 */
			
			LCD_Fill_Rect(_pBtn->Left + _Arc, _pBtn->Top, _pBtn->Height, _pBtn->Width - 2 * _Arc, CL_GREY5);		/* 铺底色 */
			LCD_Fill_Rect(_pBtn->Left, _pBtn->Top + _Arc, _pBtn->Height - 2 * _Arc, _pBtn->Width, CL_GREY5);		
			
			
			LCD_Fill_Rect(_pBtn->Left + _Arc, _pBtn->Top, _pBtn->Height / 2, _pBtn->Width - 2 * _Arc, CL_GREY6);	/* 画阴影对比色 */
			//LCD_Fill_Rect(_pBtn->Left, _pBtn->Top + _Arc, _pBtn->Height / 2 - _Arc, _pBtn->Width, CL_GREY6);	
		}

		/* 文字居中 */
		len = strlen(_pBtn->pCaption);

		if (_pBtn->Font->FontCode == FC_ST_16)
		{
			fwidth = 8;		/* 字体宽度 */
		}
		else if (_pBtn->Font->FontCode == FC_ST_12)
		{
			fwidth = 6;		/* 字体宽度 */
		}
		else if (_pBtn->Font->FontCode == FC_ST_16)
		{
			fwidth = 8;		/* 字体宽度 */
		}
		else if (_pBtn->Font->FontCode == FC_ST_24)
		{
			fwidth = 12;
		}
		else if (_pBtn->Font->FontCode == FC_ST_32)
		{
			fwidth = 16;
		}
		
		x = _pBtn->Left + _pBtn->Width / 2 - (len * fwidth) / 2;
		y = _pBtn->Top + _pBtn->Height / 2 - fwidth;

		LCD_DispStr(x, y, _pBtn->pCaption, _pBtn->Font);
}

/*
*********************************************************************************************************
*	函 数 名: LCD_ButtonTouchDown
*	功能说明: 判断按钮是否被按下. 检查触摸坐标是否在按钮的范围之内。并重绘按钮。
*	形    参:  _btn : 按钮对象
*			  _usX, _usY: 触摸坐标
*	返 回 值: 1 表示在范围内
*********************************************************************************************************
*/
uint8_t LCD_ButtonTouchDown2(BUTTON_T *_btn, uint16_t _usX, uint16_t _usY)
{
	if ((_usX > _btn->Left) && (_usX < _btn->Left + _btn->Width)
		&& (_usY > _btn->Top) && (_usY < _btn->Top + _btn->Height))
	{
		//BUTTON_BEEP();	/* 按键提示音 bsp_tft_lcd.h 文件开头可以使能和关闭 */
		_btn->Focus = 1;
		LCD_DrawButton2(_btn, 3);
		return 1;
	}
	else
	{
		return 0;
	}
}

/*
*********************************************************************************************************
*	函 数 名: LCD_ButtonTouchRelease
*	功能说明: 判断按钮是否被触摸释放. 并重绘按钮。在触摸释放事件中被调用。
*	形    参:  _btn : 按钮对象
*			  _usX, _usY: 触摸坐标
*	返 回 值: 1 表示在范围内
*********************************************************************************************************
*/
uint8_t LCD_ButtonTouchRelease2(BUTTON_T *_btn, uint16_t _usX, uint16_t _usY)
{
	if (_btn->Focus == 1)
	{
		_btn->Focus = 0;
		LCD_DrawButton2(_btn, 3);
	}
	
	if ((_usX > _btn->Left) && (_usX < _btn->Left + _btn->Width)
		&& (_usY > _btn->Top) && (_usY < _btn->Top + _btn->Height))
	{
		return 1;
	}
	else
	{
		return 0;
	}
}
#endif
